var first_letter_up = function(string) {
    return string.charAt(0).toUpperCase() + string.slice(1);
};

var provider = {
	words_list: [
		"לורם",
		"איפסום",
		"דולור",
		"סיט",
		"אמט",
		"קונסקטורר",
		"אדיפיסינג",
		"אלית",
		"צש",
		"בליא",
		"מנסוטו",
		"צמלח",
		"לביקו",
		"ננבי",
		"צמוקו",
		"בלוקריה",
		"שיצמה",
		"ברורק",
		"נולום",
		"ארווס",
		"סאפיאן",
		"פוסיליס",
		"קוויס",
		"אקווזמן",
		"קוואזי",
		"במר",
		"מודוף",
		"אודיפו",
		"בלאסטיק",
		"מונופץ",
		"קליר",
		"בנפת",
		"נפקט",
		"למסון",
		"בלרק",
		"וענוף",
		"קוואזי",
		"במר",
		"מודוף",
		"אודיפו",
		"בלאסטיק",
		"מונופץ",
		"קליר",
		"בנפת",
		"נפקט",
		"למסון",
		"בלרק",
		"וענוף",
		"לפרומי",
		"בלוף",
		"קינץ",
		"תתיח",
		"לרעח",
		"לת",
		"צשחמי",
		"צש",
		"בליא",
		"מנסוטו",
		"צמלח",
		"לביקו",
		"ננבי",
		"צמוקו",
		"בלוקריה",
		"שיצמה",
		"ברורק",
		"סחטיר",
		"בלובק",
		"תצטנפל",
		"בלינדו",
		"למרקל",
		"אס",
		"לכימפו",
		"דול",
		"צוט",
		"ומעיוט",
		"לפתיעם",
		"ברשג",
		"ולתיעם",
		"גדדיש",
		"קוויז",
		"דומור",
		"ליאמום",
		"בלינך",
		"רוגצה",
		"לפמעט",
		"מוסן",
		"מנת",
		"הועניב",
		"היושבב",
		"שערש",
		"שמחויט",
		"שלושע",
		"ותלברו",
		"חשלו",
		"שעותלשך",
		"וחאית",
		"נובש",
		"ערששף",
		"זותה",
		"מנק",
		"הבקיץ",
		"אפאח",
		"דלאמת",
		"יבש",
		"כאנה",
		"ניצאחו",
		"נמרגי",
		"שהכים",
		"תוק",
		"הדש",
		"שנרא",
		"התידם",
		"הכייר",
		"וק",
		"קולהע",
		"צופעט",
		"למרקוח",
		"איבן",
		"איף",
		"ברומץ",
		"כלרשט",
		"מיחוצים",
		"קלאצי",
		"סחטיר",
		"בלובק",
		"תצטנפל",
		"בלינדו",
		"למרקל",
		"אס",
		"לכימפו",
		"דול",
		"צוט",
		"ומעיוט",
		"",
		"לפתיעם",
		"ברשג",
		"",
		"ולתיעם",
		"גדדיש",
		"קוויז",
		"דומור",
		"ליאמום",
		"בלינך",
		"רוגצה",
		"לפמעט",
		"נולום",
		"ארווס",
		"סאפיאן",
		"",
		"פוסיליס",
		"קוויס",
		"אקווזמן",
		"קוואזי",
		"במר",
		"מודוף",
		"אודיפו",
		"בלאסטיק",
		"מונופץ",
		"קליר",
		"בנפת",
		"נפקט",
		"למסון",
		"בלרק",
		"",
		"וענוף",
		"לפרומי",
		"בלוף",
		"קינץ",
		"תתיח",
		"לרעח",
		"לת",
		"צשחמי",
		"נולום",
		"ארווס",
		"סאפיאן",
		"",
		"פוסיליס",
		"קוויס",
		"אקווזמן",
		"לורם",
		"איפסום",
		"דולור",
		"סיט",
		"אמט",
		"לורם",
		"איפסום",
		"דולור",
		"סיט",
		"אמט",
		"קונסקטורר",
		"אדיפיסינג",
		"אלית",
		"סת",
		"אלמנקום",
		"ניסי",
		"נון",
		"ניבאה",
		"דס",
		"איאקוליס",
		"וולופטה",
		"דיאם",
		"וסטיבולום",
		"אט",
		"דולור",
		"קראס",
		"אגת",
		"לקטוס",
		"וואל",
		"אאוגו",
		"וסטיבולום",
		"סוליסי",
		"טידום",
		"בעליק",
		"קונדימנטום",
		"קורוס",
		"בליקרה",
		"נונסטי",
		"קלובר",
		"בריקנה",
		"סטום",
		"לפריקך",
		"תצטריק",
		"לרטי"
		],

	letters: 'אבגדהוזחטיכלמנסעפצקרשת',

	title: function() {
		return first_letter_up(this.words(this.integer(2, 3)));
	},

	sentence: function() {
		return first_letter_up(this.words(this.integer(3, 10))) + '.';
	},

	text: function() {
		return this.sentences(this.integer(3, 6));
	},

	description: function() {
		return this.sentences(this.integer(2, 5));
	},

	short_description: function() {
		return this.sentence;
	},

	string: function() {
		return this.words();
	},

	sentences: function(n) {
		n = n || 3;

		var result = [];
		for (var i = 0; i < n; ++i) {
			result.push(this.sentence);
		}

		return result.join(' ');
	},

	word: function() {
		return this.random_element(this.words_list);
	},

	words: function(n) {
		return this.array_of_words(n).join(' ');
	},

	array_of_words: function(n) {
		n = n || 7;
		var result = [];

		for (var i = 0; i < n; ++i) {
			result.push(this.word);
		}

		return result;
	},

	letter: function() {
		return this.random_element(this.letters);
	},


};

module.exports = provider;
